//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.WriteLine("Введите пятизначное число");
int number = Convert.ToInt32(Console.ReadLine());

int Reverse(int num)
{
    int index = 0;
    int numberLenght = int.ToString(number);
    while(index < numberLenght)
    {

    }

}
